# 8. 데이터 선택(iloc)
위치를 이용하여 원하는 row에서 원하는 col 선택

In [1]:
import pandas as pd
df = pd.read_csv('DSC.txt',index_col='이명' )
df

       이름 계급    키   국어   영어   수학  과학  사회  사용호흡
이명
염주    렌고쿠  주  177   90   85  100  95  85    화염
하주   무이치로  주  160   40   35   50  55  25    안개
음주     텐겐  주  198   80   75   70  80  75    소리
연주    미츠리  주  167   40   60   70  75  80    사랑
수주     기유  주  176   15   20   10  35  10     물
충주    시노부  주  151   80  100   95  85  80    벌레
풍주    사네미  주  179   55   65   45  40  35    바람
주인공   탄지로  병  165  100   85   90  95  95  물, 해

In [2]:
df.iloc[0]

이름      렌고쿠
계급        주
키       177
국어       90
영어       85
수학      100
과학       95
사회       85
사용호흡     화염
Name: 염주, dtype: object

In [4]:
df.iloc[4]

이름       기유
계급        주
키       176
국어       15
영어       20
수학       10
과학       35
사회       10
사용호흡      물
Name: 수주, dtype: object

In [5]:
df.iloc[1:5]

      이름 계급    키  국어  영어  수학  과학  사회 사용호흡
이명
하주  무이치로  주  160  40  35  50  55  25   안개
음주    텐겐  주  198  80  75  70  80  75   소리
연주   미츠리  주  167  40  60  70  75  80   사랑
수주    기유  주  176  15  20  10  35  10    물

In [6]:
df.iloc[2,4] # 2번째 인덱스의 4번째 데이터

75

In [11]:
df.iloc[[1,3],[2,4]]

      키  영어
이명
하주  160  35
연주  167  60

In [12]:
df.iloc[1:3,2:4] #슬라이싱 대괄호 안쓰기

      키  국어
이명
하주  160  40
음주  198  80